from lmqg.spacy_module import SpacyPipeline

with open('tests/test_input.txt') as f:
       samples = f.read().split('\n')

pipe = SpacyPipeline('en', 'positionrank')
for i in samples:
       print(pipe.keyword(i))

# text = "1965年6月に戸川は、生態情報の収集や、完全な標本の入手、生け捕りを目標とし、再び高良とともに西表島を訪れた。この時に戸川らは、" \
#        "生け捕りをするために箱罠やマタタビを持ち込んでいる。しかし、猟師によって捕らえられるのは多くて年に1、2頭であったことや、生" \
#        "息個体数がさほど多くはないと推定していたため、戸川はヤマネコを生け捕りできることには期待はしていなかった。これに先立つ1965年5月5" \
#        "日に、島南部の南風見田の浜にある、通称“マーレー”と呼ばれる小さな滝の下で、遠足にきていた大原中学校の生徒がけがをして弱っているオス" \
#        "を発見し、引率の教諭が捕獲した。別の教諭がこの個体の皮をホルマリン標本に、頭骨や骨格を木箱に入れ学校の裏に埋め、後に戸川らにより掘" \
#        "り起こされ、この個体がイリオモテヤマネコのタイプ標本となった。その後も、由布島で砕けた幼獣の頭骨を手に入れ、今泉により復元" \
#        "されている。また、戸川はこの調査時に、イリオモテヤマネコよりも大きいオオヤマネコの噂を聞きつけ、調査を行っている。"
# pipe = SpacyPipeline('ja', 'textrank')
# print(pipe.keyword(text))
#
